// Ladder
// classic maps set
//

// vars level and levelset should be declared

levelset['classic'] = {
  levels: ['classic1', 'classic2', 'classic3', 'classic4', 'classic5', 'classic6', 'classic7'],
  balls_restart: 1,
  score_bonus: 45,
  score_bonus_big: 45,
  score_O: 0,
  luck: 0,
  play_type: 'victory'
};

level['classic1'] = {
  title: 'Тихое место',
  map: [
"                        X X X X X   X X X X X    ", // тихое место
"                           U         U         $ ",
"                                               H ",
"           H               #       .....       H ",
"         ==H=================H===================",
"           H                                                    ",
"           H                                                    ",
"           H        H     .                     H               ",
"       ====H========H===H==    =================H==             ",
"           @        H                           H               ",
"                          =-H-=======           H               ",
"           H                                    H               ",
"          =H============   ============= =========              ",
"           H                                                    ",
"           H                                                    ",
"           H             I                        H             ",
"       =============  ==============    ==========H=====        ",
"#                                                 H             ",
"#                                                 H             ",
"#P               ==H==H====== =====H====H=========H            #",
"#=             ==                                              #",
"#*.           I                                   I           *#",
"================================================================"
  ],
  balls_max: 6
};

level['classic2'] = {
  title: 'Спокойная прогулка',
  map: [
"                              ",
"                       U    XXXXXXXXX  XXXXXXXX                 ", // Спокойная прогулка
"XXXXXXX                                                         ", //ловушка
"  XXX                   H                                       ", //для
"XXXXXXX              ====                             $         ", //дураков
"   !                  H .                             H         ",
"   !              =   ---==H==H==H==H==H-         @   H         ",
"   !     H                                       U#   H         ",
"   !    =H=====H=======  =============H===  ============        ",
"   !     h                                                      ",
"   V     H            #                                         ",
"         H          @ #                   . .       H           ",
"#       =H=========== =====   ======H====== ========H=          ",
"#       #                                           H  # #      #",
"# I I . #                   #                       H  # #      #",
"===H====  H                 #            .  .       H  #H. .I.  #",
"         =H=======    =======  ===========  ====H====  #H########",
"          H                                            #H       ",
"          H         #                                           ",
"          H         #I                  .   .        H          ",
"         =========  ======   ============   =========H=         ",
"#                                                    H          #",
"#                          I                         H          #",
"#  P              *        #               *         H  I       #",
"================================================================="
  ],
  balls_max: 6
};

level['classic3'] = {
  title: 'Попрыгунчики',
  map: [
"#                       U  XXXXXXXXXXXX  U                     ", // попрыгунчики
"#                                                  $           ",
"#  P       H                                     .III.         ",
"===========H=                                  H======H        ",
"           H                                   H      H        ",
"           H                 .  @           .  H      H        ",
"        ===H=====     =    ======    =     ====H==    H        ",
"       X         IIIII@IIII      IIII@IIIII           .        ", // быстрый спуск
"       X                                      #       $        ",
"       X #..       H      H      H         +  #                ",
"       X ==========H==H======H====H-=H======  =====            ",
"       X           H        # . @  ##              .           ",
"       X           H        #     H                            ",
"       X           H        ===H===                            ",
"                   H                                           ",
"       X   #.      H                        I     H            ",
"       X   ===----=H====---====H==============H===H==          ",
"       X                                          H            ",
"       X                                          H            ",
"       X                       .          H       H            ",
"#           =H=               =I=         H========            #",
"#                  I        == . ==       H                    #",
"#  *             .III.         I          H       .I.I.I.   *  #",
"================================================================"
  ],
  balls_max: 6
};

level['classic4'] = {
  title: 'Веселый туннель',
  map: [
"#                  U                            U              ",
"#                                                              ",
"#   H.....H    H....H    H....H    # .    .  H  .              ",
"====H-----=====H=======H============ ==---===H========         ",
"    H          H  +        # + +             H                 ",
"    H          H           =============     H                 ",
"    H       #  H         H  XXXXXXX   H      H     -H--H-      ", // веселый
"    H       =======H=---=H============H      H                 ",
"    H            H  +      H XXXXXXX +H      H                 ", // туннель
"    H           =H=========H==========H      H                 ",
"    H           #H      +          H         H    . . . .      ",
"    HIIIIIIIII. ===================H         H   XX XXXXXX     ", // не совсем
"    H X X X X H                    H  H#     H   .IIIIIII.     ", // морг
"    H         H=====+-== -============H=     H    X X X X      ", // морг
"    H       ..H                       H      H                 ",
"#           ==H=====--====----==========     H                 ",
"#             H                            + H                 ",
"#.  .   .     H               I  I        I  H     ------      ",
"#==---==#     H    I  I  I                #  H                 ",
"#       #     H          #==--------=======  H                 ",
"#  ===  #   =====-------==                   H      P H        #",
"#   $   #         ==            I            H     ===H==      #",
"#* $$$ *# .I.                 .I.I.       .* H       *H   .I.  #",
"================================================================"
  ],
  balls_max: 6
};

level['classic5'] = {
  title: 'Отдых в горах',
  map: [
"XXXXXX         XXXXX  X  XXXXX              XXXXXX             #", // подъем  отдых в горах          лавины
" %     $                                 +  !  U !             #", //  +                             !    !
" %     H   XXXXXXXXX XXX XXXXXX !           V    V  H     P    #", //  +      приятного вам отдыха!  V    V
" %%%%> H                                H          =H===========", //  ++++>
"       H                                H           H         ",
"       HHHHHHHHHHHHH    .HHHHHHHH--------           H         ",
"#      +                  U     H              --H--H         ",
"#                               h                   H          ",
"#      H                        H     .             H     .    ",
"=======H======H====---=---===H==H===                H   -=-    ",
"       H                                     H      H          ",
"       H                                  ===H========         ",
"XXXXXX H                        H            H        I.I      #", // провал
"       H       +..III. .I.I. II H#=-------   H                 #",
"   !   H      ========H=========H    +       H          H      #",
"   !   H      === = += =    === H    -------============H=======",
"   !   H                        H                       H      ", 
"   !   H      .           +   . H   .    + .            H      ", 
"   !   ========----H----------=======------H=============      ", 
"   V                                                 .         ", 
"#              ==----   ----==       ==----===========         #",
"#                 +       +             + +     +              #",
"#III*IIIII   II II#III*III#II II*I.II I#I*III  I.       # III*I#",
"================================================================"
  ],
  balls_max: 6
};

level['classic6'] = {
  title: 'Рассеиватель',
  map: [
"                                                               ", 
"                                                               ", 
"XXXXXXXXXXXX                       I             U             ", // рассеиватель
"------------>=H======H=============H==============  XXXXXX     ", // услада
"                             hhHHHHHH                XXXXXX    ", // сердца
"                             HHH.    HHH                       ", 
"       H      I              .     .                 H         ", 
"       H======#      I       #     #I =======     ===H===      ", 
"       H      #=====H=====   # III #  U              H         ", // кривая
"       H                     #     #       XXXXXX    H         ", 
"       H                     ===H===  # $            H         ", // дорога
"       H         H              .     # H    XXXXXX  H         ", 
"  I    H       ==H====          P     #+H H          H         I", 
"  #    H         H           =============H       ====         #", 
"  #    H         H     +#                 H               H    #", 
"  #    H         H     +#           H     H          =====H==  #", 
"  =====H===+     H      ========H===H     H   XXXXXXX     H    #", // райские
"  #+   . +#      H                  H     H    !  XXXX    H    #", // кущи
"  =====H===      H                  H     +    !          H    #", 
" XXXXXXXXXXXX ===H==   ===    H     +          !          H    #", // отдыховение
"     XXXX       .+.           H==H==      ===  ! =IIII #========", // души
"I                             H   +            !I  ===H======  ", 
"#                      IIII...H-===-=        I !==>#+      +#  #", // --
"#                  ==  =======H         =====H======  .  .  #  #",
"#*     I   I     I            H           H    .   H.   I  HI *#",
"================================================================"
  ],
  balls_max: 6
};

level['classic7'] = {
  title: 'Уровень для самых счастливых',
  map: [                                   
"                                                                ", 
"    X X X X X X X X X     %   XXXXXXX XXX XXXXX XXXXXXXXXX      ", // резолюция  уровень для самых счастливых
"%%%%%%%%%%%%%%%%%%%%%%%%%%% H            U                      ", 
"                            ==========H===         ...          ", 
"                     #                             ...          ", 
"        #  P  H      #+     #                      ...  H   X   ", 
"X X X   ======H      # I    H        +   ======H====H===H       ", // все
"            U H      # . I  #        ==            +    H   X   ", 
" X X X        H      ==H=====  H                III.    H       ", // для
"              H                H==              ------- H   X   ", 
"  X X X   H   H                H            +           H       ", // вас
"          H===H                H        #   #      I    H   X   ", 
"   ! ! !  H           II++II +IH    H   #   =======H====H       ", 
"          H         ====H======H====H====     +         H   X   ", 
"          H                    H    H        +++        H       ", 
"                               H    H       +++++II..II H   X   ", 
"                               H    H       ============H       ", // миражи
"                     ==----======   H   #      $    $       V   ", 
"                                #   H   #     $$$  $$$      V   ", 
"       ===-----===              #   H   #    $$$$$$$$$$  <<<<   ", 
"I      X XXXXX   #   =          # ======#   ============       I", // а здесь
"#     XXXXXXXX   #   $           I   +                         #", // придется
"#   XXXXXXXXXXXX #IIIIII   $ I      =====                      #", // покарячиться
"#*                 .... + IH*I           I I           IIIIIIII#",
"================================================================"
  ],
  balls_max: 6
};
