// Ladder
// (re)classic maps set
//

// vars level and levelset should be declared

level['reclassic1'] = {
  title: 'Тихое место - revisited',
  map: [
"                        X X X X X   X X X X X    ", // тихое место
"                           U         U              @",
"                                             $   ",
"           H               #       .....        H",
"         ==H=================H===================",
"           H                                                    ",
"           H                                                    ",
"           H        H     .                     H               ",
"       ====H========H===H==    =================H==             ",
"           +                                    H               ",
"                          =-H-=======           H               ",
"           H                                    H               ",
"          =H============   ============= =========              ",
"           H                                                    ",
"           H                                                    ",
"           H             I                        H             ",
"       =============  ===^==========    ==========H=====        ",
"#                                                 H             ",
"#                                                 H             ",
"#P               ==H==H====== =====H====H=========H            #",
"#=             ==                                              #",
"#*.           I               H                   I           *#",
"================================================================"
  ],
  balls_max: 6
};

level['reclassic1a'] = {
  title: 'Тихое место - 3',
  map: [
"                        X X X X X   X X X X X X X X X X X X X X X    ", // тихое место
"                           U         U                       U                     @",
"                           o         o                                        $     ",
"           H               #       .....               H     o                 H H  ",
"         ==H=================H=========================H=====^==================    ",
"           H                      #                                                 ",
"           H                      #                                                 ",
"       >   H        H     .       H   .I.                  I        H +             ",
"       H===H========H===H==    ===================H=================H==             ",
"           @                                                        H               ",
"                          ------=====                               H               ",
"           H                    %%%%%                        I      H               ",
"          =H============   ============= ==============H=H============              ",
"           H                                 ########                               ",
"           H                                 I          I                           ",
"      H    h          H  I                   %%%%.%%%   H             H             ",
"      H=============  =========================H========H=============H=====        ",
"                           III                          H             H             ",
"                                     H       =====                    h             ",
"                     I            /    `       H                      H         +   ",
"        ==HHH======================    ====================H==========H=H========   ",
"           H                                                          h             ",
"           H                         +                                h             ",
"           H             I           +                                H             ",
"      /=============  ===============^===============III==============H=====        ",
"                                                     / `              H             ",
"                                                                      H +           ",
"P                ==H==H====== =====H====H============---===============H            ",
"=              ==                                     H                h         III",
"*..           I                       H                               IH          *+",
"===================================================================================="
  ],
  balls_max: 15
};

level['reclassic2'] = {
  title: 'Спокойная прогулка - revisited',
  map: [
"                       U    XXXXXXXXX  XXXXXXXX                 ", // Спокойная прогулка
"XXXXXXX                o                                        ", //ловушка
"  XXX                   H                                       ", //для
"XXXXXXX              ====                              $        ", //дураков
"   !                  H .                                       ",
"   !             -=-  ---==H-=H-=H-=H-=H-     -   U    H        ",
"   !     H                                       +#o   H ^      ",
"   !    =H=====H=======  --===========H===  ============-       ",
"   !     h                                                      ",
"   V     H            #                                         ",
"         H          + #                   . .       H           ",
"#       =H=========== =====   ====H==H=====-========H=          ",
"#       #                                           H  # #      #",
"#+I I . #                   #                       H  #H#      #",
"#==H===-  H                 #            .  .       H  #H. .I. @#",
"#  H   I =H=======    =======  ===========  ====H====  #H########",
"#  H   #  H                                            #H       ",
"#  H      H         #                                           ",
"#  H      H         #I                  .   .        H          ",
"#  H     =========  ======   ============   =========H=         ",
"#                                                    H          #",
"#P                         I                         H          #",
"##                *        #               *         H  I       #",
"================================================================="
  ],
  balls_max: 6
};

level['reclassic3'] = {
  title: 'Попрыгунчики - revisited',
  map: [
"#                       U  XXXXXXXXXXXX  U                     ", // попрыгунчики
"#                                                  $           ",
"#  P       H                                     .III.         ",
"===========H=      .                           H=======H       ",
"           H                                   H       H       ",
"           H                 .  @           .  H       H       ",
"        =========     =    ======    =     ====H==     H       ",
"       X         IIIIIoIIII      IIIIoIIIII            .       ", // быстрый спуск
"       X                                      #        H       ",
"       X #..       H      H      H         +  #                ",
"       X ==========H==H======H====H-=H======  ======           ",
"       X           H        # . +  ##               .          ",
"       X           H        #     H                            ",
"       X           H        ===H===                            ",
"                   H                                           ",
"       X   #.      H                        I     H            ",
"       X   ===----=H====---====H==============H===H==          ",
"       X                                          H            ",
"       X                                          H            ",
"       X                       .          H       H            ",
"#           =H=               =I=         H========            #",
"#                  I        == . ==       H                    #",
"#  *             .III.         I          H       .I.I.I.   * o#",
"================================================================"
  ],
  balls_max: 6
};

level['reclassic4'] = {
  title: 'Веселый туннель - revisited',
  map: [
"#                  U       U                       U              ",
"#                                                                 ",
"#   H.I...I.   H....H    H....H    # .    .     H  .              ",
"====H-------===H=======H====H======= ==---======H========         ",
"    H          H  +        #I++                 H     o           ",
"    H          H           =============        H                 ",
"    H     #--  H         H  XXXXXXX   H         H     -H--H-      ", // веселый
"    H       =======H=--==H============H         H                 ",
"    H            H  +      H XXXXXXX +H         H                 ", // туннель
"    H          I=H=========H==========H         H                 ",
"    H           #H      @          H            H    . . . .      ",
"    HIIIIIIIII. ===================H   +II      H   XX XXXXXX     ", // не совсем
"    H X X X X H                    H  H##       H   .IIIIIII.     ", // морг
"    H         H=====+-II -============H=        H    X X X X      ", // морг
"    H       ..H                       H         H                 ",
"#           ==H=====--====----==========        H                 ",
"#             H                            +    H          ++     ",
"#   .         H               I  I        I     H-----------      ",
"#==---==#     H    I  I  I                #     H                 ",
"#       #     H          #==--------=======     H                 ",
"#  ===  #   =====-------==                      H      P H        ",
"#   $   #         ==            I               H     ===H==      ",
"#* $@$ *# .I.                 .I.I.          .* H       *H  .II.  ",
"=================================================================="
  ],
  balls_max: 10
};

level['reclassic5'] = {
  title: 'Отдых в горах - revisited',
  map: [
"XXXXXX         XXXXX  X  XXXXX              XXXXXX             #", // подъем  отдых в горах          лавины
" %     $                                 @  !  U !             #", //  +                             !    !
" %     H   XXXXXXXXX XXX XXXXXX !           V    V  H     P    #", //  +      приятного вам отдыха!  V    V
" %%%%> H                                H          =H===========", //  ++++>
"       H                                H           H         ",
"       HHHHHHHHHHHHH    .HHHoHHHH--------           h         ",
"#      +                    U   H              --H--H         ",
"#                               h                   H          ",
"#      H                        H                   H    +.    ",
"=======H======H====---=---===H==H===                H   -=-    ",
"       H                                     H      H          ",
"       H                                  ===H========         ",
"XXoXXX H                        H            H        I.I      #", // провал
"       H       +..III  .I.I. II H#=-------   H                 #",
"   !   H      ========H=========H    +       H          H      #",
"   !   H      === = += =    === H    -------============H=======",
"   !   H                        H                       H      ", 
"   !   H      .           +   . H   .    + .            H      ", 
"   !   ========----H----------=======------H=============      ", 
"   V                        ^                        .         ", 
"#   +         H==----= =----==       ==----===========         #",
"#   +             +   +   +            ^ +                     #",
"#III*IIIII   II II#III*III#II II*I.II I#I*III  I.       # III*I#",
"================================================================"
  ],
  balls_max: 6
};

level['reclassic6'] = {
  title: 'Рассеиватель - revisited',
  map: [
"                                                               ", 
"                                                               ", 
"XXXXXXXXXXXX     U                 I             U             ", // рассеиватель
"------------>=H======H=============H==============  XXXXXX     ", // услада
"                             hhHHHHHH                XXXXXX    ", // сердца
"                             HHH.    HHH                       ", 
"       H      I              .     .                 H         ", 
"       H======#      I       #     #I =======     ===H===      ", 
"       H      #=====H=====   # III #  U              H         ", // кривая
"       H                     #     #  @    XXXXXX    H         ", 
"       H                     ===H=== o# $            H         ", // дорога
"       H         H              .     # H    XXXXXX  H         ", 
"  I    H       ==H====                #+H  H         H         I", 
"  #    H         H      P    ===#==========H      ====         #", 
"  #    H         H      #                  H              H    #", 
"  #    H         H      #           H      H         =====H==  #", 
"  =====H===+     H      ========H===H      H              H    #", // райские
"  #++  . +#      H                  H      H              H    #", // кущи
"  =====H===      H                  H                     H    #", 
" oXXXXXXXXXXX ===H==   ===    H     +                     H    #", // отдыховение
"     XXXX       .+.           H==H==       ==    #IIII #========", // души
"I                             H   +             I  ===H=====   ", 
"#                      IIII...H-===-=        I     #+ + + +#   #",
"#                  ==  =======H         =====H======  .  . #   #",
"#*     I   I     I            H           H    .   H.   I HI  *#",
"================================================================"
  ],
  balls_max: 6
};

level['reclassic7'] = {
  title: 'Уровень для самых счастливых - revisited',
  map: [                                   
"                                                            ", 
"                                         o                  ",
"                            H            U                  ", 
"                            =====H====H===         ...      ", 
"                     #                             ...      ", 
"        #  P  H      #+     #                      ...  H   ", 
"        ======H      # I    H            ===========H===H   ",
"            U H      # . I  #        ==            +    H   ",
"            o H      ==H=====  H                  I     H   ",
"              H                H==                ----- H   ",
"          H   H                H            +           H   ",
"          H===H                H        #   #      I    H   ", 
"          H           II+ II .IH        #   =======H====H   ", 
"          H         -===H======H=======H=               H  @", 
"          H                    H                        H   ", 
"                               H            @ $  II..II H   ", 
"                            I  H             ===H=======H   ",
"                     ==----====== H            I # I    h   ", 
"                                # H     #               h   ", 
"       ===-----===              # H   . #    . # I # .  H   ", 
"I                #   =          # ======#   =====H======H  I",
"#                #           I   I   +                  H  #",
"#                #IIIIIIIII HI      =====               h  #",
"#*                 @ .. ++  *I           I I          <IIII#",
"============================================================"
  ],
  balls_max: 6
};

level['reclassic7a'] = {
  title: 'Уровень для самых счастливых - 3',
  map: [                                   
"                                                                ", 
"                                         o                      ",
"                            H            U                      ", 
"                            =====H====H===         ...          ", 
"                     #                             ...          ", 
"        #  P  H      #+     #                      ...  H       ", 
"        ======H      # I    H            ===========H===H       ",
"            U H      # . I  #        ==            +    H       ",
"              H      ==H=====  H                  I     H       ",
"              H                H==                ----- H       ",
"          H   H                H            +           H       ",
"          H===H                H        #   #      I    H     o ", 
"          H         IoII+ II .IH        #   =======H====H     = ", 
"          H         #===H======H=======H=     @         H  @    ", 
"          H                ..  H             @@@        H       ", 
"                            I  H            @@$@III..II H       ", 
"                     .    .@I  H             ====H======H       ",
"                     ==----=H==== H             I # I   h       ", 
"                                # H     #               h       ", 
"       ===-----===         @    # H   . #  . .  #   # . H       ", 
"I         I   I  #   =          # ======#   =====H======H      I",
"#                #           I   I   +                  H      #",
"#           .    #IIIIIIIII+HI      =====               h      #",
"#*    H   -.^.-             *I           I I          <IIIIIIII#",
"================================================================"
  ],
  balls_max: 8
};


levelset['reclassic'] = {
  levels: [
    'reclassic1', 'reclassic2', 'reclassic3', 'reclassic4', 'reclassic7',
    'reclassic5', 'reclassic6',
    'reclassic1a', 'reclassic7a'
  ],
  // other parameters: speed, score
  score_bonus: 45,
  score_bonus_big: 55,
  play_type: 'victory'
};
